In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name" : ["Harry", "Ramesh", "Rohit", "Shubh"],
    "Marks" : [90, 88, 79, 95],
    "City" : ["Rampur", "Pune", "Mumbai", "Delhi"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     88    Pune
2   Rohit     79  Mumbai
3   Shubh     95   Delhi

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends.csv", index=False)

In [7]:
df.head(2)

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     88    Pune

In [8]:
df.tail(2)

    Name  Marks    City
2  Rohit     79  Mumbai
3  Shubh     95   Delhi

In [9]:
df.describe()

           Marks
count   4.000000
mean   88.000000
std     6.683313
min    79.000000
25%    85.750000
50%    89.000000
75%    91.250000
max    95.000000

In [10]:
df['Marks']

0    90
1    88
2    79
3    95
Name: Marks, dtype: int64

In [11]:
df['Marks'][1]

88

In [12]:
df['Marks'][1] = 91

C:\Users\Admin\AppData\Local\Temp\ipykernel_14516\2633012401.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Marks'][1] = 91

In [13]:
df

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     91    Pune
2   Rohit     79  Mumbai
3   Shubh     95   Delhi

In [14]:
df.index = ["first", "second", "third", "fourth"]

In [15]:
df

          Name  Marks    City
first    Harry     90  Rampur
second  Ramesh     91    Pune
third    Rohit     79  Mumbai
fourth   Shubh     95   Delhi

In [16]:
df["Name"]["first"]

'Harry'

In [17]:
ser = pd.Series(np.random.rand(34))

In [18]:
ser

0     0.040089
1     0.670709
2     0.461110
3     0.576305
4     0.529812
5     0.627100
6     0.264000
7     0.320512
8     0.540393
9     0.585781
10    0.774159
11    0.813298
12    0.990590
13    0.508601
14    0.358826
15    0.866642
16    0.584736
17    0.936511
18    0.130093
19    0.689652
20    0.078055
21    0.162494
22    0.087035
23    0.373854
24    0.386639
25    0.777236
26    0.180363
27    0.380768
28    0.074793
29    0.963685
30    0.753927
31    0.125909
32    0.197470
33    0.701087
dtype: float64

In [19]:
type(ser)

pandas.core.series.Series